src/test/resources/Emulation_Input/RefundLookUp.xml

<S:Envelope
    xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <wsse:Security
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>SVCSamsInstantSaving</wsse:Username>
                <wsse:Password>qtayWn-wW7+%*NAbs1W1</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <S:Body>
        <ns2:CheckOutRefundRequest
            xmlns="http://www.xmlns.walmartstores.com/membership/bsl/datatypes/CheckOutRefund/1.0.0/"
            xmlns:ns2="http://www.xmlns.walmartstores.com/membership/bsl/messages/CheckOutRefund/1.0.0/"
            xmlns:ns3="http://www.xmlns.walmartstores.com/membership/Header/datatypes/MessageHeader/1.0/"
            xmlns:ns4="http://www.xmlns.walmartstores.com/membership/Header/datatypes/MembershipHeader/1.0/">
            <ns2:MessageHeader>
                <ns3:PrefLanguage>101</ns3:PrefLanguage>
                <ns3:SrcSysId>TABLET</ns3:SrcSysId>
                <ns3:SubId>S[B@3bc53bc5</ns3:SubId>
                <ns3:CnsmrId>C[B@47e047e2</ns3:CnsmrId>
                <ns3:SrvcNm>CheckOutRefund.CheckOutRefund</ns3:SrvcNm>
                <ns3:TranId>150</ns3:TranId>
                <ns3:Version>1.0</ns3:Version>
            </ns2:MessageHeader>
            <ns2:CheckOutRefundRequestBody>
                <CustomerBasket>
                    <Customer>
                        <MembershipNbr>10134220204006426</MembershipNbr>
                    </Customer>
                    <Channel>
                        <Code>1</Code>
                        <Description>POS</Description>
                    </Channel>
                    <RefundTransaction>
                        <BasketID>9739</BasketID>
                        <CreateTimeStamp>2020-07-17T23:00:29.000</CreateTimeStamp>
                        <BusinessUnit>
                            <ClubNumber>6279</ClubNumber>
                            <CountryCode>US</CountryCode>
                        </BusinessUnit>
                        <Terminal>
                            <TerminalID>4891</TerminalID>
                        </Terminal>
                    </RefundTransaction>
                    <Orderlines>
                        <OrderLine>
                            <LineNumber>1</LineNumber>
                            <Id>817546</Id>
                            <Quantity>4</Quantity>
                            <isExchange>false</isExchange>
                            <Originating>
                                <BasketID>8783</BasketID>
                                <CreateTimeStamp>2020-07-16T15:54:44</CreateTimeStamp>
                                <BusinessUnit>
                                    <ClubNumber>6279</ClubNumber>
                                    <CountryCode>US</CountryCode>
                                </BusinessUnit>
                                <Terminal>
                                    <TerminalID>8948</TerminalID>
                                </Terminal>
                            </Originating>
                        </OrderLine>
                    </Orderlines>
                </CustomerBasket>
            </ns2:CheckOutRefundRequestBody>
        </ns2:CheckOutRefundRequest>
    </S:Body>
</S:Envelope> 